In [2]:
import pandas as pd
import numpy as np

import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
df=pd.read_csv('../output/step3/processed_file.csv')
df=df[df.columns[1:]]

In [10]:
df.head()

                  time       area  month  day  hour  minute  weekday
0  2014-04-01 00:11:00  Manhattan      4    1     0      11        1
1  2014-04-01 00:17:00        NaN      4    1     0      17        1
2  2014-04-01 00:21:00  Manhattan      4    1     0      21        1
3  2014-04-01 00:28:00  Manhattan      4    1     0      28        1
4  2014-04-01 00:33:00  Manhattan      4    1     0      33        1

In [12]:
set(df.month)

{4, 5, 6, 7, 8, 9}

In [14]:
df[df['month']<=7].to_csv('../output/step4/train.csv')
df[df['month']>7].to_csv('../output/step4/test.csv')

In [4]:
df[df['month']<=7]

                        time       area  month  day  hour  minute  weekday
0        2014-04-01 00:11:00  Manhattan      4    1     0      11        1
1        2014-04-01 00:17:00        NaN      4    1     0      17        1
2        2014-04-01 00:21:00  Manhattan      4    1     0      21        1
3        2014-04-01 00:28:00  Manhattan      4    1     0      28        1
4        2014-04-01 00:33:00  Manhattan      4    1     0      33        1
...                      ...        ...    ...  ...   ...     ...      ...
3506186  2014-05-31 23:45:00  Manhattan      5   31    23      45        5
3506187  2014-05-31 23:52:00  Manhattan      5   31    23      52        5
3506188  2014-05-31 23:55:00   Brooklyn      5   31    23      55        5
3506189  2014-05-31 23:56:00     Queens      5   31    23      56        5
3506190  2014-05-31 23:59:00  Manhattan      5   31    23      59        5

[2676916 rows x 7 columns]

In [11]:
sum(df['month']<=7)

2676916